---
kind: property
id: P:Autodesk.Revit.DB.FormatValueOptions.AppendUnitSymbol
source: html/0dc9c311-6f58-3195-c04d-808fa65ca338.htm
---
# Autodesk.Revit.DB.FormatValueOptions.AppendUnitSymbol Property

Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions.

## Syntax (C#)
```csharp
public bool AppendUnitSymbol { get; set; }
```